# DataFrames
DataFrames are the workhouse of pandas and are directly inspire by the R programmaing language.We think of a DataFrame as a bunch of Series object 
put together to share the same index.Let's use pandas to explore this topic.

In [2]:
import pandas as pd
import numpy as np
olympic_data={'Host_city':['London', 'Beijing', 'Athens','Sedney','Atlanta'],
             'Year':[2012,2008,2004,2000,1996],
              'No. of Participating Countries':[205,204,201,200,197]
             }

store_here=pd.DataFrame(olympic_data)
print(store_here)

  Host_city  Year  No. of Participating Countries
0    London  2012                             205
1   Beijing  2008                             204
2    Athens  2004                             201
3    Sedney  2000                             200
4   Atlanta  1996                             197

In [3]:
from numpy.random import randn

# with seed we both will have same numbers

np.random.seed(101)

In [4]:
df=pd.DataFrame(randn(5,4),index='A B C D E'.split(),columns='W X Y Z'.split())
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

# Selection and Indexing

#### let's learn here various methds to grab data from a DataFrame

In [5]:
df['W']

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [6]:
df['Y']

A    0.907969
B   -0.848077
C    0.528813
D   -0.933237
E    2.605967
Name: Y, dtype: float64

In [7]:
# selecting the multiple coulmns

In [8]:
df[['W','Z']]

          W         Z
A  2.706850  0.503826
B  0.651118  0.605965
C -2.018168 -0.589001
D  0.188695  0.955057
E  0.190794  0.683509

In [9]:
# SQL quarities in the dataframe (NOT RECOMMENDED)

df.W

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

# DataFrame Columns are just Series

In [10]:
type(df['W'])

pandas.core.series.Series

#### Creating a new column

In [12]:
df['new']=df['W']+df['Z']

In [13]:
# adding the both w and z columns

df

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.210676
B  0.651118 -0.319318 -0.848077  0.605965  1.257083
C -2.018168  0.740122  0.528813 -0.589001 -2.607169
D  0.188695 -0.758872 -0.933237  0.955057  1.143752
E  0.190794  1.978757  2.605967  0.683509  0.874303

In [14]:
# deleting the columns

df.drop('new',axis=1)

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [15]:
df.drop('A',axis=0)

          W         X         Y         Z       new
B  0.651118 -0.319318 -0.848077  0.605965  1.257083
C -2.018168  0.740122  0.528813 -0.589001 -2.607169
D  0.188695 -0.758872 -0.933237  0.955057  1.143752
E  0.190794  1.978757  2.605967  0.683509  0.874303

In [17]:
df.drop('new',axis=1,inplace=True)

In [18]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [25]:
df.drop('B',axis=0,inplace=True)

In [26]:
df

          W         X         Y         Z
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

# "**Selecting Rows**"

In [29]:
# what are the content of the A row

df.loc['C']

W   -2.018168
X    0.740122
Y    0.528813
Z   -0.589001
Name: C, dtype: float64

In [30]:
# Or selsect based off of position insted of label

In [31]:
df.iloc[2]

W    0.190794
X    1.978757
Y    2.605967
Z    0.683509
Name: E, dtype: float64

# **Selecting subset of rows and columns**

In [33]:
df.loc['C','Y']

0.5288134940893595

In [38]:
df.loc['D','W']

0.18869530944922425

In [42]:
df.loc[['C','D'],['W','Y']]

          W         Y
C -2.018168  0.528813
D  0.188695 -0.933237

In [43]:
df

          W         X         Y         Z
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [44]:
df.loc[['C','E'],['X','Z']]

          X         Z
C  0.740122 -0.589001
E  1.978757  0.683509

# Conditional Selection
An important feature of pandas is conditional selsectionusing bracket notation,very similar to numpy:

In [45]:
df

          W         X         Y         Z
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [47]:
# condition

#1 boolean condition
df>0

       W      X      Y      Z
C  False   True   True  False
D   True  False  False   True
E   True   True   True   True

In [48]:
df[df>0]

          W         X         Y         Z
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [52]:
df[df['Z']>0.7]

          W         X         Y         Z
D  0.188695 -0.758872 -0.933237  0.955057

In [53]:
# only number in W column which are greater than 0 will be printed

df[df['W']>0.6]['Y']

Series([], Name: Y, dtype: float64)

In [54]:
df[df['W']>0]['Y']

D   -0.933237
E    2.605967
Name: Y, dtype: float64

In [55]:
df[df['W']>0]

          W         X         Y         Z
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [56]:
df[df['W']>0]['X']

D   -0.758872
E    1.978757
Name: X, dtype: float64

In [58]:
df[df['Z']>.7]['W']

D    0.188695
Name: W, dtype: float64

In [59]:
df=pd.DataFrame(randn(5,4),index='A B C D E'.split(),columns='W X Y Z'.split())
df

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

In [62]:
df[df['W']>0][['Y','X','Z']]

          Y         X         Z
A -1.706086  1.693723 -1.159119
C  0.638787  0.072960  0.329646

#### For two conditions you can use| and & with parenthesis:

In [66]:
df[(df['W']>0)&(df['Y']>0)]

          W        X         Y         Z
C  0.807706  0.07296  0.638787  0.329646

In [68]:
df[(df['Y']>0)&(df['Z']>0)]

          W         X         Y         Z
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
E -0.116773  1.901755  0.238127  1.996652

In [70]:
df[(df['X']>0)|(df['Z']>0)]

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

#### More Index Details
Let's discuss some more features of indexing,including resetting the index or setting it somethig else.We'll also talk about index hierarchy!

In [71]:
df

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

In [72]:

# Reset to defaut 0, 1,,,n index
df.reset_index()

  index         W         X         Y         Z
0     A  0.302665  1.693723 -1.706086 -1.159119
1     B -0.134841  0.390528  0.166905  0.184502
2     C  0.807706  0.072960  0.638787  0.329646
3     D -0.497104 -0.754070 -0.943406  0.484752
4     E -0.116773  1.901755  0.238127  1.996652

In [76]:
name_state='CA KA WY OR MH'.split()

In [78]:
df['States']=name_state

In [79]:
df

          W         X         Y         Z States
A  0.302665  1.693723 -1.706086 -1.159119     CA
B -0.134841  0.390528  0.166905  0.184502     KA
C  0.807706  0.072960  0.638787  0.329646     WY
D -0.497104 -0.754070 -0.943406  0.484752     OR
E -0.116773  1.901755  0.238127  1.996652     MH

In [82]:
df.set_index('States')

               W         X         Y         Z
States
CA      0.302665  1.693723 -1.706086 -1.159119
KA     -0.134841  0.390528  0.166905  0.184502
WY      0.807706  0.072960  0.638787  0.329646
OR     -0.497104 -0.754070 -0.943406  0.484752
MH     -0.116773  1.901755  0.238127  1.996652

In [83]:
df

          W         X         Y         Z States
A  0.302665  1.693723 -1.706086 -1.159119     CA
B -0.134841  0.390528  0.166905  0.184502     KA
C  0.807706  0.072960  0.638787  0.329646     WY
D -0.497104 -0.754070 -0.943406  0.484752     OR
E -0.116773  1.901755  0.238127  1.996652     MH

In [84]:
df.set_index('States',inplace=True)

In [85]:
df

               W         X         Y         Z
States
CA      0.302665  1.693723 -1.706086 -1.159119
KA     -0.134841  0.390528  0.166905  0.184502
WY      0.807706  0.072960  0.638787  0.329646
OR     -0.497104 -0.754070 -0.943406  0.484752
MH     -0.116773  1.901755  0.238127  1.996652

In [86]:
df

               W         X         Y         Z
States
CA      0.302665  1.693723 -1.706086 -1.159119
KA     -0.134841  0.390528  0.166905  0.184502
WY      0.807706  0.072960  0.638787  0.329646
OR     -0.497104 -0.754070 -0.943406  0.484752
MH     -0.116773  1.901755  0.238127  1.996652